{
  "questions": [
    {
      "title": "Often Sends Contradictory or Ambiguous Signals.",
      "bullet_points": [
        "Can appear simultaneously aloof and vulnerable, a combination some find compelling.",
        "May alternate between frequent communication and periods of silence.",
        "Might make comments suggesting a future together (e.g., \"When we eventually live together...\") but then behave as if no such future is anticipated."
      ]
    },
    {
      "title": "Places High Value on Independence and Self-Reliance.",
      "bullet_points": [
        "Frequently expresses a need for \"a lot of personal space.\"",
        "May state that their career or personal pursuits leave little room for a serious relationship.",
        "Often voices a preference for partners who are entirely self-sufficient and dislikes perceived \"neediness.\""
      ]
    },
    {
      "title": "May Belittle or Devalue Partner (or Past Partners), Sometimes Humorously.",
      "bullet_points": [
        "Might make jokes about a partner's minor flaws (e.g., map-reading skills, physical traits).",
        "May describe a past romantic interest as initially appealing but later disappointing due to a superficial flaw.",
        "Could have a history of infidelity."
      ]
    },
    {
      "title": "Employs Distancing Tactics (Emotional or Physical).",
      "bullet_points": [
        "Might have maintained long-term past relationships where partners lived separately.",
        "May prefer to sleep in their own home, use separate bedding, or sleep in different beds.",
        "Could favor solo vacations.",
        "Often leaves future plans vague (e.g., when to meet next, cohabitation timelines).",
        "May physically maintain distance, like walking ahead of a partner."
      ]
    },
    {
      "title": "Stresses Boundaries Within the Relationship.",
      "bullet_points": [
        "Can create a sense that their social circles (friends, family) are off-limits to the partner.",
        "May be reluctant to host at their place, preferring the partner's home."
      ]
    },
    {
      "title": "Holds an Idealized or Unrealistic Vision of Relationships.",
      "bullet_points": [
        "Often speaks about a future quest for a \"perfect\" soulmate.",
        "May romanticize a past relationship while being unclear about its demise.",
        "Might express sentiments like, \"I doubt I'll ever feel that strongly for someone again.\""
      ]
    },
    {
      "title": "Displays Mistrust; Fears Exploitation by Partner.",
      "bullet_points": [
        "May believe that romantic partners are trying to \"trap\" them into commitment or marriage.",
        "Can be concerned about being financially exploited by a partner."
      ]
    },
    {
      "title": "Adheres to Rigid Relationship Views and Uncompromising Rules.",
      "bullet_points": [
        "May have strict preferences for a partner's characteristics (e.g., specific appearance, profession).",
        "Often holds firm beliefs about relationship structures (e.g., separate residences, avoiding marriage).",
        "Prone to generalizations like \"All men/women are like X\" or \"Relationships always change for the worse after marriage/cohabitation.\"",
        "May dislike common modes of connection, like phone calls, even if important to the partner."
      ]
    },
    {
      "title": "During Disagreements, Tends to Withdraw or \"Explode.\"",
      "bullet_points": [
        "May abruptly end discussions with statements like, \"Just drop it, I'm not talking about this.\"",
        "Can become angry and leave the situation."
      ]
    },
    {
      "title": "Keeps Intentions and Feelings Obscure, Leaving Partner Uncertain.",
      "bullet_points": [
        "May be in a long-term relationship without expressing love verbally.",
        "Can become angry and leave the situation."
      ]
    },
    {
      "title": "Finds it Difficult to Discuss the State of the Relationship.",
      "bullet_points": [
        "May make a partner feel awkward for inquiring about the relationship's direction.",
        "When a partner expresses a concern, might offer a cursory apology without deeper engagement.",
        "Certain topics may be strictly off-limits for discussion."
      ]
    }
  ]
}