{
  "questions": [
    {
      "title": "Craves Deep Relational Intimacy.",
      "bullet_points": [
        "Readily agrees to significant steps like joint holidays, moving in, or dedicating nearly all their time to a partner early on, though they may not be the one to suggest these.",
        "Enjoys and seeks substantial physical closeness, such as holding hands, caressing, and kissing."
      ]
    },
    {
      "title": "Often Expresses Insecurity and Fear of Abandonment.",
      "bullet_points": [
        "May ask numerous questions about a partner's past relationships to understand their own position and feel more secure.",
        "Frequently attempts to ascertain if a partner harbors lingering feelings for an ex.",
        "Makes considerable efforts to please their partner.",
        "Harbors fears that their partner's affection or sexual desire will diminish."
      ]
    },
    {
      "title": "Feels a Strong Need to Be in a Relationship.",
      "bullet_points": [
        "Can give off a sense of urgency or desperation to find a romantic partner, even if unstated.",
        "Dates can sometimes resemble an evaluation process for a long-term partner."
      ]
    },
    {
      "title": "May Use Tactics to Maintain Attention or Interest.",
      "bullet_points": [
        "Might act distant or feign disinterest if a partner hasn't been in touch for a period.",
        "May pretend to be unavailable or overly occupied.",
        "Could attempt to orchestrate situations to make a partner more engaged or available."
      ]
    },
    {
      "title": "Struggles to Articulate Discomfort; Expects Partner to Discern Issues.",
      "bullet_points": [
        "Relies on their partner to understand through indirect signals that they are upset, potentially acting out if these cues are missed."
      ]
    },
    {
      "title": "Tends to \"Act Out\" Rather Than Directly Resolve Conflicts.",
      "bullet_points": [
        "Might threaten to end the relationship during arguments, only to reconsider later.",
        "Often doesn't voice their needs directly but can become visibly upset due to an accumulation of unaddressed hurts."
      ]
    },
    {
      "title": "Prone to Personalizing Relationship Events.",
      "bullet_points": [
        "If a partner has a work commitment during a social event, they might interpret it as a rejection (e.g., \"You don't want to be around my friends\").",
        "If a partner is tired and needs quiet time, they might see it as a loss of affection (e.g., \"You don't find me engaging anymore\")."
      ]
    },
    {
      "title": "Often Mirrors Partner's Pace to Avoid Vulnerability.",
      "bullet_points": [
        "May match their partner's communication frequency or expressions of affection, especially early on, as a protective measure."
      ]
    },
    {
      "title": "Shows Significant Preoccupation with the Relationship.",
      "bullet_points": [
        "After a date, they might extensively analyze every detail with friends, while the partner may simply relax.",
        "When apart, may either contact their partner very frequently or, defensively, not at all, waiting for the partner to initiate.",
        "It's often clear that the relationship occupies a great deal of their thoughts."
      ]
    },
    {
      "title": "Believes Minor Issues Can Destabilize the Relationship; Feels Obligated to Work Hard for Partner's Interest.",
      "bullet_points": [
        "May voice concerns like, \"I've called so much, I hope I'm not being overwhelming,\" or \"I'm worried I didn't make a good impression on your family, and now they won't approve of me.\""
      ]
    },
    {
      "title": "Inclined Towards Suspicion of Partner's Fidelity.",
      "bullet_points": [
        "Might seek access to a partner's private accounts (e.g., email).",
        "Can be overly watchful of their partner's whereabouts.",
        "May search through a partner's personal items for signs of infidelity."
      ]
    }
  ]
}